import 'package:flutter/material.dart';

import '../Models/data.dart';
import 'data_detail_page.dart';

class DataListPage extends StatefulWidget {
  const DataListPage({Key? key}) : super(key: key);

  @override
  State<DataListPage> createState() => _DataListPageState();
}

class _DataListPageState extends State<DataListPage> {
  @override
  Widget build(BuildContext context) {
    List<Data> datas = [
      Data(
          title: 'สาเหตุการตาย',
          image: 'assets/images/data/สาเหตุการตาย.png',
          detail:
              'มีคดีที่มี ‘คนตาย’ โดยที่โคนันไปอยู่ในจุดเกิดเหตุ และไปพบศพ ทั้งหมด 203 คน (ไม่นับคนที่ตายไปในอดีต) โดยจากตอนทั้งหมด มีสาเหตุการตายที่พบมากที่สุดคือ การถูกเชือกรัดคอ ซึ่งอาวุธที่ใช้ก็มีทั้งเชือกทั่วไป ไปจนถึงวิกผมปลอม เอ็น และไม้แขวนเสื้อด้วย\n'
              '\nสาเหตุการตายอันดับ 2 ที่รองลงมา คือการถูกทุบตี และโดนกระแทกด้วยของแข็ง ซึ่งมีทั้งการถูกคนร้ายนำมาทุบ และถูกผลักให้หัวชน หรือกระแทก โดยที่อาวุธก็มีทั้งเลเวลธรรมดาอย่างก้อนหิน ค้อน และสิ่งของอย่างถ้วยรางวัล เชิงเทียน ดัมเบล เหรียญ และไม้เซลฟี่ด้วย\n'
              '\nสาเหตุการตายอย่างการถูกเชือกรัดคอนั้น เป็นสาเหตุหลักตั้งแต่เล่มแรกๆ ถึงเล่มท้ายๆ แต่ถึงอย่างนั้น พวกเราก็ยังพบว่า ในช่วงหลังๆ สาเหตุการตายอย่าง ‘ยาพิษ’ ก็เริ่มเป็นที่นิยม และใช้มากขึ้น โดยมักเป็นการแอบใส่ยาพิษเข้าไปยังอาหาร ที่มีทั้งน้ำชา หรือขนมเค้ก และมีเหตุการณ์ที่ใน 1 วัน โคนันไปพบศพที่ตายจากเหตุยาพิษมากถึง 3 ศพ ในวันเดียวเลยด้วย\n'),
      Data(
          title: 'คดีอื่นๆ',
          image: 'assets/images/data/คดีอื่นๆ.png',
          detail:
              'จากการรวบรวมคดีที่ไม่ใช่การฆาตรกรรม ซึ่งพบว่ามีการฆ่าตัวตายทั้งหมด 8 คน โดยเป็นทั้งการฆ่าตัวตายที่หนีความผิด และตัดสินใจจบชีวิตของตัวเองด้วย (นับจากการฆ่าตัวตายที่มีโคนันไปพบศพ ไม่นับเหตุการณ์ในอดีต)\n'
              '\nและยังมีคดีที่เล่าย้อนไปถึงเหตุการณ์ในอดีต สมัยของชินอิจิ ก่อนที่จะกลายมาเป็นโคนันทั้งหมด 8 คดี  โดยมีตั้งแต่ย้อนความทรงจำไปตอนที่ชินอิจิเป็นเด็กเนิร์สเซอรี่ และคดีแรกที่ชินอิจิเริ่มไขคดี\n'
              '\nทั้งยังมีคดีอีก 91 คดี ที่ไม่มีการตาย เช่น คดีขโมยของ ลักพาตัว เรียกค่าไถ่ ซึ่งคนรอบข้างโคนันเอง อย่างอายูมิ, ดร.อากาสะ และรัน หรือแม้แต่ทั้งแก๊งขบวนการนักสืบเองก็มี ที่มักจะตกเป็นเหยื่อของการลักพาตัว'),
      Data(
          title: 'อาชีพคนร้าย',
          image: 'assets/images/data/อาชีพคนร้าย.png',
          detail:
              'ในเนื้อเรื่องโคนัน ฉบับมังงะ ค่อยข้างมีการปรากฏตัวของตัวคะครที่มีอาชีพหลากหลาย โดยมีการระบุอาชีพคนร้ายทั้งหมด 67 อาชีพ แต่อาชีพที่เป็นคนร้ายมากที่สุด คือ กลุ่มคนที่ไม่มีการระบุอาชีพในเรื่องทั้งหมด 56 คน รองลงมาคือโจร ซึ่งในเล่มที่ 14-26 เป็นช่วงที่มีโจรชุกชุมมากที่สุด โดยมีคดีที่มีโจรมากถึง 20 คน ซึ่งในนี้มีแก๊งโจรปล้นธนาคารด้วย และตามมาด้วยกลุ่มพนักงานบริษัทที่เป็นอีกอาชีพ ที่พบได้บ่อยในการ์ตูนเรื่องนี้ คือ 26 คน\n'
              "\nนอกจากนี้ ยังมีชายชุดดำ และจอมโจรคิด ที่ถือว่าเป็นคนร้าย และยังมีอาชีพที่น่าสนใจที่ปรากฏในเล่มอย่าง นายพราน คนทรงเจ้า นักวิจารณ์อาหาร นักพัฒนาเกม ในการ์ตูนเรื่องนี้"),
      Data(
          title: 'อาชีพเหยื่อ',
          image: 'assets/images/data/อาชีพเหยื่อ.png',
          detail:
              'เช่นเดียวกับอาชีพคนร้าย อาชีพของเหยื่อเอง ก็ค่อนข้างหลากหลาย โดยมีอาชีพของเหยื่อที่แตกต่างซึ่งปรากฎในโคนัน ถึง 59 อาชีพ และอาชีพที่เป็นเหยื่อมากที่สุด คือ กลุ่มคนที่ไม่มีการระบุอาชีพเช่นกัน ตามมาด้วยพนักงานบริษัท ที่ตกเป็นเหยื่อ 28 คน และเจ้าของกิจการ อีก 23 คน ที่มักพบเป็นเหยื่อจากความไม่พอใจของลูกน้อง หรือจากความบาดหมางทางธุรกิจ\n'
              '\nตัวเหยื่อเอง ก็มีการปรากฏตัวของอาชีพที่น่าสนใจไม่แพ้กับอาชีพของผู้ร้ายเช่นกัน เช่น นักวิจัยประวัติศาสตร์, นักอาชญวิทยา, ช่างทำตุ๊กตา และพ่อค้ายาเสพติดด้วย'),
      Data(
          title: 'เพศ',
          image: 'assets/images/data/เพศ.png',
          detail:
              'จากเพศของผู้ร้าย และเหยื่อ เราพบว่า ส่วนใหญ่แล้วจะเป็นเพศชาย มากกว่าเพศหญิง โดยจากคนร้ายทั้งหมด 281 คน มีเพศชายมากถึง 214 คน หรือคิดเป็น 76% ในขณะที่มีเพศหญิงที่เพียง 67 คน หรือคิดเป็น 24%\n\nในส่วนของเหยื่อเอง ก็มีเพศชายทั้งหมด 169 คน หรือคิดเป็น 71% และเพศหญิง 68 คน หรือ 29% โดยทั้งผู้ร้ายและเหยื่อ ไม่มีการปรากฏตัวของเพศที่ 3 หรือเพศทางเลือกเลย มีเพียงชาย และหญิงเท่านั้น'),
      Data(
          title: 'แรงจูงในในการฆ่า',
          image: 'assets/images/data/แรงจูงในในการฆ่า.png',
          detail:
              'จากคดีฆาตรกรรมทั้งหมด เราได้แบ่งหมวดของแรงจูงใจในการฆ่าไว้ทั้งหมด 17 รูปแบบ โดยแรงจูงใจที่พบมากที่สุดในการก่อฆาตรกรรมคือ การแก้แค้นให้คนอื่น 64 คดี ซึ่งส่วนใหญ่มักจะเป็นการแก้แค้นให้คนในครอบครัว โดยเฉพาะ พ่อ และแม่ ที่ถูกทำให้ตายไปก่อนหน้านี้ แต่ก็มีในส่วนของการแก้แค้นให้เพื่อน และแฟนเช่นกัน\n\nรองลงมาคือความแค้นส่วนตัวของตัวเอง 40 คดี ซึ่งมีเรื่องราวความแค้นของลูกจ้าง ที่ถูกเจ้านายเอาไปเปรียบเหมือนสุนัขด้วย ตามมาด้วยการฆ่าปิดปาก เพื่อไม่ให้เปิดเผยความลับอีก 20 คดี และการข่มขู่ แบล็กเมล์ 15 คดี และการฆ่าเพื่อเอาเงินและทรัพย์สิน อีก 10 คดี ใน Top 5\n\nนอกจากนี้ ยังมีเรื่องของการเข้าใจผิด 9 คดี ซึ่งคนร้ายมักเข้าใจตัวเหยื่อผิด จึงทำการฆ่าไป เช่น ฆ่าเพราะคิดว่าเหยื่อจะมาขโมยหน้าที่การงาน แต่แท้จริงแล้ว เหยื่อทำไปเพราะเป็นแฟนคลับของผู้ร้าย เป็นต้น เรียกได้ว่า เหยื่อตายฟรี จากความเข้าใจผิดล้วนๆ ด้วย'),
      Data(
          title: 'สถานที่เกิดเหตุ',
          image: 'assets/images/data/สถานที่เกิดเหตุ.png',
          detail:
              'ในโคนันเอง มีฉากและการเดินทางไปไขคดีในที่ใหม่ๆ เกือบทุกตอน โดยบางตอน ก็มีสถานที่เกิดเหตุหลายจุด แต่เราเน้นนับแต่จุดที่พบเจอศพ หรือเหยื่อเท่านั้น ซึ่งแยกได้เป็น 40 จุดเกิดเหตุ และเราพบว่า เหตุการณ์ส่วนใหญ่มักเกิดขึ้นในที่อยู่อาศัย 83 ครั้ง ไม่ว่าจะเป็นบ้าน แมนชั่น หรือคอนโด ซึ่งบ้านของชินอิจิ และดร.อากาสะเอง ก็กลายเป็นจุดเกิดเหตุบ่อยครั้ง\n\nตามมาด้วย โรงแรม และเกสเฮาท์ 29 ครั้ง ซึ่งมักเป็นตอนที่โคนัน เดินทางไปในจังหวัดต่างๆ รวมถึงยังมียานพาหนะ 13 ครั้ง อย่าง รถไฟ เรือ หรือรถขนของ ที่ก็กลายเป็นจุดเกิดเหตุด้วยเช่นกัน\n\nจุดเกิดเหตุอื่นๆ ที่น่าสนใจ แต่ไม่ติด top 10 ยังมีทั้ง สตูดิโอ/กองถ่าย, ลานสเก็ต, ห้องซ้อมดนตรี, ฮอลล์จัดแสดง และสำนักงานนักสืบของโมริเอง ก็เคยเป็นจุดที่เกิดเหตุเช่นกันด้วย'),
      Data(
          title: 'ภูมิภาคที่เกิดเหตุ',
          image: 'assets/images/data/ภูมิภาคที่เกิดเหตุ.png',
          detail:
              'แม้เนื้อเรื่องของโคนัน มักจะอยู่ในเมืองเบกะ (เมืองนี้ไม่มีจริง) ในโตเกียว แต่ตัวโคนันเอง ก็เดินทางไปพบศพ และคดีมากมาย หลายภูมิภาคมาแล้ว โดยคดีส่วนใหญ่เกิดขึ้นในโตเกียวถึง 196 ครั้ง รองลงมาคือ จังหวัดกุนมะ ที่มีสารวัตรยามามูระประจำการอยู่ ตามมาด้วยสถานที่ที่ไม่มีการระบุภูมิภาคอีก 12 ครั้ง และจังหวัดชิสึโอกะ 10 ครั้ง ที่มีคุณตำรวจโยโคมิโซะ ซังโงประจำการอยู่\n\nนอกจากนี้ ยังมีโอซาก้า ถิ่นของเฮย์จิ 7 ครั้ง ซึ่งมักเป็นตอนที่มีเฮย์จิ และคาซึฮะปรากฏตัวด้วย นากาโนะ 6 คดี ของแก๊งคุณตำรวจอย่างยามาโตะ คันซึเกะ, อุเอฮาระ ยูอิ และโมโรฟุชิ ทากาอากิ ประจำการอยู่ ตามมาด้วย คานากาวา 5 คดี จังหวัดที่โยโคมิโซะ จูโง น้องชายของซังโง ประจำการ และเมืองสมมติ 3 คดี ที่เป็นการแต่งชื่อเมืองขึ้นมาเอง โอคุโฮะ เป็นต้น\n\nจังหวัดอื่นๆ ที่เหลือคือ ฮอกไกโด, ฟูกูอิ, โทชิงิ, ไซตามะ, มิยางิ, ทตโทริ, อาโอโมริ, เฮียวโงะ และโอกินาว่า อย่างละ 1 ครั้ง และมีการบินออกนอกญี่ปุ่น ไปต่างประเทศ คือลอนดอน ประเทศอังกฤษ 1 ครั้ง ในเล่ม 71-72'),
    Data(title: 'จำนวนครั้งที่โดนยิงยาสลบ',
        image: 'assets/images/data/จำนวนครั้งที่โดนยิงยาสลบ.png',
        detail: 'หนึ่งอุปกรณ์ และฉากไฮไลต์ของเรื่องโคนัน ไม่ใช่ฉากใส่นาฬิกาที่ยืมเพื่อนมา แต่เป็นฉากยิงยาสลบจากนาฬิกา ซึ่งแน่นอนว่า คนที่โดนยาสลบนี้บ่อยที่สุดก็คือ โมริ โคโกโร่ ซึ่งโดนไปทั้งหมด 46 ครั้ง ทำให้ได้ชื่อโคโกโร่นิทรามาในการไขคดี รองลงมาคือ ซึซึกิ โซโนโกะ 10 ครั้ง ที่มักเรียกตัวเองว่า ราชินีสืบสวนโซโนโกะ ตามมาด้วยคนร้าย 5 ครั้ง ซึ่งมักเป็นการยิงเพื่อไม่ให้คนร้ายหลบหนี หรือทำร้ายได้\n\nทั้งนี้ ยังมีสารวัตรยามามูระ ที่โดนยิงยาสลบ และไขคดีอีก 3 ครั้ง รวมถึงรัน โคนัน ไฮบาระ ยิน และเฮย์จิด้วย อย่างละ 1 ครั้ง'),
      Data(title: 'จำนวนครั้งที่ปรากฏตัว',
          image: 'assets/images/data/จำนวนครั้งที่ปรากฏตัว.png',
          detail: 'นอกจากโคนัน รัน และโมริแล้ว ยังมีตัวละครอีกมากมายที่โผล่มาแวะเวียนในเรื่องนี้ ทั้งตัวละครขององค์กรและหน่วยงานต่างๆ โดยเราพบว่า แก๊งนักสืบเยาวชน เป็นเหล่าตัวละครที่ออกมามากที่สุด คือ 91 คดี ตามมาด้วยฮัตโตริ เฮย์จิ นักสืบตะวันตก 41 คดี\n\nFBI ก็เป็นเหล่าตัวละครที่ปรากฏบ่อยครั้งในโคนัน โดยมีทั้งอาจารย์โจดี้, อากาอิ ชูอิจิ หรือโอกิยะ สึบารุ ที่มาวนเวียนใกล้ๆ โคนัน และเพื่อนๆ บ่อยๆ ถึง 37 คดี และชายชุดดำ 24 คดี ซึ่งมีทั้งตัวละครอย่าง ยิน วอดก้า เบลม็อท และคนอื่นๆ ตำรวจสันติบาล 15 คดี ที่ปรากฏตัวในเล่มหลังๆ ที่เนื้อหาเริ่มสืบสาวเข้าหาชายชุดดำมากขึ้น\n\nจอมโจรคิด 14 คดี ซึ่งมักเป็นคดีที่เขาตั้งใจมาก่อเหตุขโมย หรือเข้ามาช่วยโคนันก็มี และชินอิจิ 6 คดี ที่เป็นโคนัน ซึ่งกินยาให้กลายร่างกลับมาเป็นชินอิจิ และหน่วยงาน CIA อีกทั้งหมด 4 คดีด้วย')
    ];
    return Scaffold(
      appBar: AppBar(
        title: const Text('เปิดข้อมูลการไขปริศนา'),
        backgroundColor: const Color.fromARGB(255, 49, 63, 99),
      ),
      body: Container(
        decoration: const BoxDecoration(
            image: DecorationImage(
          image: AssetImage("assets/images/w3.jpg"),
          fit: BoxFit.cover,
        )),
        child: ListView.builder(
          itemCount: datas.length,
          //callback function
          itemBuilder: (BuildContext context, int index) {
            var data = datas[index];

            return Card(
              child: InkWell(
                onTap: () {
                  _handleClickProjectItem(datas[index]);
                },
                child: Padding(
                  padding: const EdgeInsets.all(16),
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Row(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          const SizedBox(
                            width: 10,
                          ),
                          Expanded(
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                const SizedBox(
                                  height: 10,
                                ),
                                Text(
                                  data.title,
                                  style: const TextStyle(
                                      fontWeight: FontWeight.bold,
                                      fontSize: 20),
                                ),
                                const SizedBox(
                                  height: 10,
                                ),
                              ],
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                ),
              ),
            );
          },
        ),
      ),
    );
  }

  void _handleClickProjectItem(Data d) {
    Navigator.push(
      context,
      MaterialPageRoute(
          builder: (context) => DataDetailPage(
                data: d,
              )),
    );
  }
}
