import 'package:conanproject/Models/ep.dart';
import 'package:flutter/material.dart';

import 'ep_detail_page.dart';

class EpListPage extends StatefulWidget {
  const EpListPage({Key? key}) : super(key: key);

  @override
  State<EpListPage> createState() => _EpListPageState();
}

class _EpListPageState extends State<EpListPage> {
  @override
  Widget build(BuildContext context) {
    List<EP> epi=[
      EP(title: 'ชายชุดดำและFBI',
          image: 'assets/images/ep/maninblack.jpg',
          detail: '💣 ปี1\n'
          '-ตอน 1 คดีฆาตกรรมรถไฟเหาะ (ยินและวอสก้า องค์กรชุดดำ )\n'
      '\n💣 ปี2\n'
    '-ตอน56 คดีฆาตกรรมบริษัทเกม (เตกีล่า องค์กรชุดดำ)\n'
    '\n💣 ปี3\n'
    '-ตอน124-125 คดีฆาตกรรมต่อเนื่องแห่งนานิวะ (นูมามูจิ คิอิจิโร เคยอยู่ในองค์กรชุดดำ)\n'
    '-ตอน135 คดีปล้นเงินพันล้านขององค์กรชุดดำ (มิยาโนะ อาเคมิ พี่สาวของไฮบาระ องค์กรชุดดำ เคยคบกับ อากาอิ ชูอิจิ)\n'
    '-ตอน136-139 ผู้หญิงที่มาจากองค์กรชุดดำ กับคดีฆาตกรรมอาจารย์มหาวิทยาลัย (มิยาโนะ ชิโฮะ หรือไฮบาระ เจ้ตัวเล็ก องค์กรชุดดำ)\n'
    '\n💣 ปี4\n'
    '-ตอน181-182 มุมอับในความมืด เคยถูกองค์กรชุดดำปองร้ายจนต้องย้ายบ้านไปอยู่นอกเมือง (คุณหมออาราอิเดะร่วมมือกับFBI จัดฉากว่าตายแล้ว เพื่อให้เบลม็อทปลอมตัวเป็นคุณหมอแทน)\n'
    '-ตอน190-192 การเผชิญหน้าอีกครั้งกับองค์กรชุดดำ (ปิสโก้, มิยาโนะ ชิโฮะ องค์กรชุดดำ)\n'
    '\n💣ปี5\n'
    'ตอน 245-246 กับดักเกมต่อสู้ (อาจารย์โจดี้ สตาร์ลิ่ง หรือ เจ้าหน้าที่FBI ที่ปลอมตัวเป็นอาจารย์สอนภาษาอังกฤษ)\n'
    '\n💣ปี6\n'
    '-ตอน249-250 ผู้โดยสารปริศนา (อากาอิ ชูอิจิ เจ้าหน้าที่FBI ที่เข้าไปแฝงตัวในองค์กรชุดดำ และอาจารย์โจดี้ เจ้าหน้าที่FBI)\n'
    '-ตอน277-278 บุรุษผู้มาจากชิคาโก้ (เจมส์ แบล็ก ,อากาอิ ชูอิจิ และอาจารย์โจดี้ เจ้าหน้าที่FBI)\n'
    '-ตอน291-292 สิ่งเตือนความจำจากคดีฆาตกรรม (อากาอิชูอิจิ เจ้าหน้าที่FBI ที่ปลอมตัวเข้าไปให้องค์กรชุดดำ)\n'
    '-ตอน293-294 ชื่อย่อที่รีบซุกซ่อน (อาจารย์โจดี้ สตาร์ลิ่ง หรือ เจ้าหน้าที่FBI ที่ปลอมตัวเป็นอาจารย์สอนภาษาอังกฤษ)\n'
    '\n💣 ปี7\n'
    '-ตอน299-300 ครูสอนภาษาอังกฤษปะทะยอดนักสืบตะวันตก (โคนันและเฮย์จิ เริ่มสงสัยอาจารย์โจดี้)\n'
    '-ตอน308-310 คุโด้ ชินอิจิกับคดีในนิวยอร์ก (อากาอิชูอิจิ เจ้าหน้าที่FBI ไล่ล่าผู้ชายผมยาวโรคจิต ที่ปลอมตัวโดยเบล์มอท องค์กรชุดดำ)\n'
    '-ตอน311-312 มิสึฮิโกะในป่าวงกต (นูมามูจิ คิอิจิโร เคยอยู่ในองค์กรชุดดำ)\n'
    '-ตอน332-333 หลักฐานไร้เสียงที่หลงเหลืออยู่ (ซิสเต็มส์ เอ็นจิเนียร์ อิตาคุระ สุโงรุ คนที่ทำโปรแกรมให้องค์กรชุดดำ)\n'
    '-ตอน334-336 การติดต่อกับองค์กรชุดดำ (โคนันสวมรอยเป็น อิตาคุระ นัดส่งมองโปรแกรมให้ยินและวอดก้า)\n'
    '\n💣 ปี8\n'
    '-ตอน363-364 รถปอร์เช่ทั้ง 4 คัน (อาจาร์โจดี้ สงสัยในตัวไฮบาระ)\n'
    '-ตอน365-366 ความลับที่ซ่อนในห้องสุขา (มิยาโนะ อัทซึชิ และมิยาโนะ เอเลน่า องค์กรชุดดำ หรือพ่อแม่ของไฮบาระ)\n'
    '-ตอน369-370 กับดักในร้านสะดวกซื้อ (อาจารย์โจดี้ เจ้าหน้าที่FBI)\n'
    '-ตอน371-375 ปะทะองค์กรชุดดำ ปริศนาคูณสองในคืนเดือนเพ็ญ (เบลม็อทปลอมตัวเป็นหมออาราอิเดะ จะมาจับไฮบาระ แต่อาจารย์โจดี้ เจ้าหน้าที่FBI ชินจับตัวไฮบาระมาก่อน แต่ไฮบาระก็ถูกปลอดตัวโดยโคนัน และ คาลวาโดส องค์กรชุดดำ ถูกอากาอิ ชูอิจิ จับได้ จึงฆ่าตัวตาย)\n'
    '-ตอน376-377 ค้นหาเครื่องหมายที่ติดอยู่ที่ก้น (ต่อจากตอนที่แล้ว อาจารย์โจดี้ขอให้ไฮบาระเข้าโครงการคุ้มครองพยาน ในช่วงแรกของเรื่อง)\n'
    '\n💣 ปี9\n'
    '-ตอน419-421 เสียงที่ไม่เข้ากันของสตราดีวาริอุส (ไม่เกี่ยวข้องมากมีแต่เสียงรหัสส่งเมลที่เบลม็อทส่งให้บอสขององค์กรชุดดำตอนก่อนหน้านี้)\n'
    '\n💣 ปี10\n'
    '-ตอน459-463 แบล็คอิมแพ็ค วินาทีที่อยู่ในเงื้อมมือองค์กร (ฮอนโด ฮิเดมิ เจ้าหน้าที่CIA ที่เข้าแฝงตัวในองค์กรชุดดำชื่อ คีย์ หรือที่รู้จักกันในนามนักประกาศข่าว มิซึนาชิ เรย์นะ ,เคียนติ กอร์น องค์กรชุดดำ)\n'
    '-ตอน502-505 เงาขององค์กรชุดดำ (ฮอนโด เอย์สึเกะ น้องชายของ ฮอนโด ฮิเดมิ หรือมิซึนาชิ เรย์นะ คีย์)\n'
    '\n💣 ปี11\n'
    '-ตอน527-528 ที่อยู่ของรูปถ่ายสีดำ (สืบหาพ่อของ ฮอนโด เอย์สึเกะ และ ฮอนโด ฮิเดมิ หรือมิซึนาชิ เรย์นะ เจ้าหน้าที่CIA)\n'
    '-ตอน548-551 ดำปะทะแดงเดือด (ฮอนโด เอย์สึเกะ สืบหาตัว ฮอนโด ฮิเดมิ หรือมิซึนาชิ เรย์นะ เจ้าหน้าที่CIA, คุสึดะ ริคุมิจิ องค์กรชุดดำและเป็นตัวตายตัวแทนตบตาองค์กรชุดดำว่าอากาอิชูอิจิตายแล้ว, อังเดร คาเมล เจ้าหน้าที่FBIและทั้งหมด)\n'
    '-ตอน554-555 มุมอับในร้านคาราโอเกะ (ฮอนโด เอย์สึเกะ)\n'
    '-ตอน556 สีแดง, ขาว, เหลืองและขบวนการนักสืบเยาวชน (โอกิยะ ซึบะรุ ที่ปลอมตัวโดยอากาอิ ชูอิจิ เพื่อกลบดารและอาศัยที่บ้านชินอิจิเพื่อปกป้องไฮบาระ)\n'
    '-ตอน557 โคนันปะทะปริศนารหัสซ้อน (โอกิยะ ซึบะรุ ที่ปลอมตัวโดยอากาอิ ชูอิจิ เพื่อกลบดารและอาศัยที่บ้านชินอิจิเพื่อปกป้องไฮบาระ)\n'
    '-ตอน558 ประลองการสืบคดี ชินอิจิ ปะทะ โอกิยะ สึบารุ (โอกิยะ ซึบะรุ ที่ปลอมตัวโดยอากาอิ ชูอิจิ เพื่อกลบดารและอาศัยที่บ้านชินอิจิเพื่อปกป้องไฮบาระ)\n'
    '\n💣 ปี12\n'
    '-ตอน593-594 โขดหินอิคาคุที่ปลาหายไป (โอกิยะ สึบะรุ หรืออากาอิชูอิจิ เจ้าหน้าที่FBI ที่คอยตามดูแลไฮบาระ)\n'
    '\n💣 ปี13\n'
    '-ตอน614-615 ชมรมนักสืบเยาวชนปะทะโจรปล้นธนาคาร (เจ้าหน้าที่FBI และอากาอิ ชูอิจิตัวปลอม )\n'
    '-ตอน629 วิกฤษเรียกหาโดยลางสังหรณ์สีแดง (เจ้าหน้าที่FBI)\n'
    '-ตอน630 ข้อเสนอสีดำทั้งสิบสาม (เจ้าหน้าที่FBI ,อากาอิ ชูอิจิตัวปลอม และองค์กรชุดดำ)\n'
    '-ตอน631 ไทม์ลิมิตสีดำที่เข้ามาใกล้ (เจ้าหน้าที่FBI ,อากาอิ ชูอิจิตัวปลอม และองค์กรชุดดำ)\n'
    '-ตอน632 เป้าหมายสีแดงที่สั่นเครือ (เจ้าหน้าที่FBI ,อากาอิ ชูอิจิตัวปลอม และองค์กรชุดดำ)\n'
    '\n💣 ปี14\n'
    '-ตอน697-698 ดวลสืบคดีในโรงแรมผีสิง (เซระ มะสึมิ นักสืบม.ปลายมาใหม่ หรือน้องสาวของอากาอิ ชูอิจิ)\n'
    '-ตอน699-701 คดีบุกยึดสำนักงานนักสืบ (เซระ มะสึมิ นักสืบม.ปลายมาใหม่ หรือน้องสาวของอากาอิ ชูอิจิ)\n'
    '-ตอน702-703 โคนัน ปะทะ เฮย์จิ ศึกดวลสองนักสืบตะวันออกตะวันตก (เซระ มะสึมิ นักสืบ ม.ปลายมาใหม่ หรือน้องสาวของอากาอิ ชูอิจิ และเจ้าหน้าที่FBI)\n'
    '-ตอน708-709 เว็บไซต์วิดิโอของด็อกเตอร์ (เซระ มะสึมิ นักสืบม.ปลายมาใหม่ หรือน้องสาวของอากาอิ ชูอิจิ)\n'
    '\n💣 ปี15\n'
    '-ตอน719-720 เวดดิ้งอีพ (อามุโระ โทโอรุ สายลับตำรวจญี่ปุ่น หรือเบอร์เบิ้นที่แฝงตัวในองค์กรชุดดำ)\n'
    '-ตอน723-726 ดนตรีรัตติกาลของเหล่านักสืบ (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร, เบลม็อท องค์กรชุดดำ, เซระ มะสึมิ และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน736-737 ฟองน้ำ ไอน้ำ และควัน (โอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน742-743 คดีแช่เย็นของคุโด้ ยูซากุ (โอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI )\n'
    '-ตอน 751-752 เงาที่เข้าใกล้ความลับของไฮบาระ (เซระ มาสึมิ น้องสาวอากาอิ ชูอิจิ, เชอร์รี่ ที่เคยอยู่ในองค์กรชุดดำ มิยะโนะ ชิโฮะ หรือที่รู้จักกันชื่อ ไฮบาระ และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน753-756 รถด่วนสีดำ (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร, เบลม็อท องค์กรชุดดำ, เชอร์รี่ ที่เคยอยู่ในองค์กรชุดดำ มิยะโนะ ชิโฮะ หรือที่รู้จักกันชื่อ ไฮบาระ และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน757 โคนันในห้องปิดตาย (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร, เบลม็อท องค์กรชุดดำ, เชอร์รี่ ที่เคยอยู่ในองค์กรชุดดำ มิยะโนะ ชิโฮะ หรือที่รู้จักกันชื่อ ไฮบาระ และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน758 เบอร์เบิ้นผู้ไขปริศนา (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร)\n'
    '\n💣 ปี16\n'
    '-ตอน774-775 บริการส่งพัสดุที่ทั้งหวานและเย็น (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร)\n'
    '-ตอน786-787 ความทรงจำของโจดี้กับกับดักชมดอกไม้ (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร และเบลม็อท องค์กรชุดดำ, โจดี้ สตาร์ลิ้ง เจ้าหน้าที่FBI)\n'
    '-ตอน804-805 คดีแมวกวักสามสี (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร)\n'
    '\n💣 ปี17\n'
    '-ตอน832 อารัมภบทสีแดงเข้ม (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร และเบลม็อท องค์กรชุดดำ, โจดี้ สตาร์ลิ้ง และ คาเมล เจ้าหน้าที่FBI)\n'
    '-ตอน833 การไล่ตามของสีแดงเข้ม (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร, โจดี้ สตาร์ลิ้ง และ คาเมล เจ้าหน้าที่FBI)\n'
    '-ตอน834 ทางข้ามของสีแดงเข้ม (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร และเบลม็อท องค์กรชุดดำ, โจดี้ สตาร์ลิ้ง ,คาเมล และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน835 การกลับมาของสีแดงเข้ม (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร ชุดดำ, โจดี้ สตาร์ลิ้ง ,คาเมล และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI)\n'
    '-ตอน836 ความจริงของสีแดงเข้ม (อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร ชุดดำ, โจดี้ สตาร์ลิ้ง ,คาเมล และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI และมีการพูดถึงรัม หนึ่งในองค์กรชุดดำ)\n'
    '-ตอน838-839 การแข่งขันแห่งรักของไทโคเมจิน (เซระ มาสึมิน้องสาวของ อากาอิชูอิจิ)\n'
    '-ตอน840-841 การจมน้ำปริศนาในสระว่ายน้ำกลางฤดูร้อน (เซระ มาสึมิน้องสาวของ อากาอิชูอิจิ และแมรี่ ที่กลายเป็นเด็ก อาจจะเป็นแม่ของทั้งสองคน)\n'
    '-ตอน845-846 ผู้พบ 3 คนแรก (โจดี้ สตาร์ลิ้ง ,คาเมล และโอกิยะ สึบะรุ หรืออากาอิ ชูอิจิ เจ้าหน้าที่FBI และมีการพูดถึงรัม หนึ่งในองค์กรชุดดำในตอนต้นเรื่องและท้ายEng Credit)\n'
    '-ตอน868 เงาที่ย่องเข้าใกล้อามุโร่ ((อามุโร โทโอรุ สายลับตำรวจญี่ปุ่น หรือ เบอร์เบิ้น ที่แฝงตัวในองค์กร ชุดดำ)\n'
    '\n💣 ปี18\n'
    '-ตอน891-892 เกิร์ลแบนด์กับความสัมพันธ์อันแย่ อามุโร่ เซระมะซึมิ มีการพูดถึงอดีตของชูอิจิ(นิดหน่อย)\n'
    '-ตอน905 พาสเวิร์ดของทะเบียนสมรส (ในend credit มีการพูดถึง ฮาเนดะ โคจิ ที่คาดว่าถูกรัม คนในองค์กรชุดดำฆ่าตาย หรืออาจถูกให้กินยา APTX-1869ยังคงเป็นปริศนา)\n'
    '-ตอน916-917 เหมือนกับที่เกิดเหตุเมื่อ 17 ปีก่อน (ซึบารุ มีการพูดถึงฮาเนดะ โคจิ ที่คาดว่าถูกรัม คนในองค์กรชุดดำฆ่าตาย หรืออาจถูกให้กินยา APTX-1869)\n'
    '-ตอน918-919 คดีฆาตรกรรมนักสืบวิญญาณ (แมรี่ เด็กที่อยู่กับเซระมะซึมิ มีการพูดถึงการตายของฮาเนดะ โคจิในคดีเมื่อ17ปีก่อน คาดว่าอาซากะ รัม เป็นคนฆ่า และยิน องค์กรชุดดำ)\n'
    '-ตอน921-922 เวทีแห่งการทรยศ (โอกิยะ ซึบะรุ , อามุโร่  ที่แฝงตัวในองค์กร ชื่อเบอร์เบิ้ล ,เบลมอท คนขององค์กรชุดดำ)\n'
    '\n💣 ปี19\n'
    '-ตอน933-934 มุมอับในห้องลองเสื้อ (การนึกถึงอดีตที่เคยเจอกันของเซระ มาซึมิ กับ รัน และชินอิจิที่อังกฤษ ในสมัยเด็ก)\n'
    '-ตอน936-937 จอมเวทแห่งคลื่น (เรื่องราวในอดีตเมื่อ10ปีก่อน ที่เคยเจอกัน ของครอบครัว อากาอิ เซระ และ ชินอิจิ)\n'
    '-ตอน940-941 ไขปริศนาที่ร้านปัวโรต์ (มีบุคคลน่าสงสัย อาจอยู่ในองค์กรชุดดำ)\n'
    '-ตอนที่ 962 บอร์ดี้การ์ดแห่งเจลีก (เจ้าหน้าที่ FBI)\n'
    ),
      EP(title: 'โคโก่โร่ไขคดีเอง ไม่ง้อโคนัน!!!',
          image: 'assets/images/ep/mori.jpg',
          detail: 'Episode 8 ตอน คดีฆาตกรรมเจ้าของหอศิลป์\n'
    'Episode 28-29 ตอน คดีฆาตกรรมสมาคมศิษย์เก่าของโคโกโร่\n'
    'Episode 55 ตอน คดีฆาตกรรมอาวุธปริศนา\n'
    'Episode 95-96 ตอน คดีฆาตกรรมหฤโหดนักเดินเขา\n'
    'Episode 99-102 ตอน เมื่อยอดนักสืบจนมุม! กับคดีฆาตกรรมใหญ่ 2 คดีต่อเนื่อง\n'
    'Episode 110-111 ตอน คดีแก๊งค์โจรในคฤหาสน์ปริศนา\n'
    'Episode 160-161  ตอน ความจริงในคดีรถระเบิด\n'
    'Episode 330-331 ตอน ผู้ต้องสงสัยที่มองไม่เห็น\n'
    'Episode 356-357 ตอน แกงเผ็ดที่น่าสงสัย\n'
    'Episode 402-403 ตอน ทางเดินที่พูดไม่ได้\n'
    'Episode 432-433 ตอน การจ้างวานจากครอบครัวพิลึก\n'
    'Episode 483 ตอน ความลับของรัสเซียน บลู\n'
    'Episode 503 ตอน เงาขององค์กรชุดดำ (ภาคแสงไฟพิศวง)\n'
    'Episode 511 ตอน รถเช่าที่ควบคุมไม่ได้\n'
    'Episode 530-531 ตอน นิยายรักตำรวจนครบาล ภาค 8: แหวนของซาโต้\n'
    'Episode 579-580 ตอน ปริศนาที่ไม่อ่อนไหว\n'
    'Episode 591-592 ตอน วันที่โมริ โคโกโร่เลิกเป็นนักสืบ\n'
    'Episode 596-597 ตอน แม่มดในม่านหมอก\n'
    'Episode 640-641 ตอน วันเกิดที่เลวร้ายที่สุด\n'
    'Episode 643-644 ตอน ลิงคุมาเดะและพวกวิ่งราว\n'
    'โคนัน เดอะมูฟวี่ ตอน ยุทธการเหนือห้วงทะเลลึก\n'
    'โคนัน เดอะมูฟวี่ ตอน ปริศนานักล่าทรชนทมิฬ\n'
    ),
      EP(title: 'รวมตอนโรแมนติก ซาโต้-ทาคางิ',
          image: 'assets/images/ep/police.jpg',
          detail: 'ปี 4\n'
              'ตอนที่ 156-157 นิยายรักตำรวจนครบาล\n'
              'ตอนที่ 166-167 นิยายรักตำรวจนครบาล ภาค 2\n'
              '\nปี 5\n'
              'ตอนที่ 220-221 นิยายรักตำรวจนครบาล ภาค 3\n'
              '\nปี 6\n'
              'ตอนที่ 259-260 คดีคุมตัวผู้ต้องหาในชินคังเซ็น\n'
              'ตอนที่ 272-272 นิยายรักตำรวจนครบาล ภาค 4\n'
              '\nปี 7\n'
              'ตอนที่ 323-324 ขบวนพาเหรดของความดีและความชั่ว\n'
              'ตอนที่ 326-329 กรมตำรวจสั่นคลอน ตัวประกัน 12 ล้านคน\n'
              '\nปี 8\n'
              'ตอนที่ 389-390 นิยายรักตำรวจนครบาล ภาค 5\n'
              '\nปี 9\n'
              'ตอนที่ 424-425 นิยายรักตำรวจนครบาล ภาค 6\n'
              'ตอนที่ 435-436 คดีโจรปล้นเพรช\n'
              '\nปี 10\n'
              'ตอนที่ 469-470 นิยายรักตำรวจนครบาล ภาค 7\n'
              'ตอนที่ 487-488 นิยายรักตำรวจนครบาล ภาคพิธีวิวาห์ปลอม\n'
              '\nปี 11\n'
              'ตอนที่ 530-531 นิยายรักตำรวจนครบาล ภาค 8 แหวนของซาโต้\n'
              '\nปี 12\n'
              'ตอนที่ 581-582 ตัวจริงของตำนานเมือง\n'
              'ตอนที่ 586 แผลเก่าและจิตวิญญาณของตำรวจ\n'
              '\nปี 13\n'
              'ตอนที่ 659-660 วันไวท์เดย์แห่งการทรยศ\n'
              '\nปี 15\n'
              'ตอนที่ 733-735 การออกอากาศความรักที่เดิมพันด้วยชีวิต\n'
              '\nปี 16\n'
              'ตอนที่ 801-802 นิยายรักตำรวจนครบาล\n'
              'ตอนที่ 805 คดีแมวกวักสามสี\n'
              '\nปี 18\n'
              'ตอนที่ 883 ราเมงที่อร่อยจยแทบตาย 2\n'
              'ตอนที่ 906 ทัวร์นรกแห่งความรัก\n'
              'โคนัน เดอะมูฟวี่ ตอน บทเพลงมรณะแด่เหล่านักสืบ\n'
              'โคนัน เดอะมูฟวี่ ตอน เจ้าสาวฮาโลวีน\n'
      ),EP(title: 'นักสืบตะวันตก ฮัตโตริ เฮย์จิ!!!',
          image: 'assets/images/ep/heiji.jpg',
          detail: '🧢 ปีที่ 2\n'
    'ตอนที่ 49 - 50 คดีฆาตกรรมนักการทูต\n'
    'ตอนที่ 59 - 60 คดีฆาตกรรมคนบ้าโฮล์มส์\n'
    'ตอน 80 - 81 คดีฆาตกรรมต่อเนื่องในบ้านเศรษฐี\n'
    '\n🧢 ปีที่ 3\n'
    'ตอนที่ 124 - 125 คดีฆาตกรรมต่อเนื่องแห่งนานิวะ\n'
    '\n🧢 ปีที่ 4\n'
    'ตอนที่ 151 - 152 คดีฆาตกรรมห้องปิดตายในคืนก่อนแต่งงาน\n'
    'ตอนที่ 177 - 179 อาถรรพ์บ้านแมงมุมที่ทตโทริ\n'
    'ตอนที่ 185 - 188 แผนฆ่าปีที่ 20 คดีฆาตกรรมต่อเนื่อง ซิมโฟนีหมายเลข 1\n'
    '\n🧢 ปีที่ 5\n'
    'ตอนที่ 203 - 208 การคืนชีพที่เดิมพันด้วยชีวิต\n'
    'ตอนที่ 241 - 243 และแล้วนางเงือกก็หายไป\n'
    '\n🧢 ปีที่ 6\n'
    'ตอนที่ 257 - 258 คดี 3K ที่โอซาก้า\n'
    'ตอนที่ 282 - 285 โอวาก้าดับเบิ้ลมิสทรี่ นักดาบแห่งนานิวะกับปราสาทเจ้าพิภพ\n'
    '\n🧢 ปีที่ 7\n'
    'ตอนที่ 299 - 300 ครูสอนภาษาอังกฤษ ปะทะ ยอดนักสืบตะวันตก\n'
    'ตอนที่ 313 - 315 เจ้าหญิงแห่งเกาะร้างกับปราสาทมังกร\n'
    'ตอนที่ 348 - 349 ฮัตโตริ เฮย์จิเข้าตาจน\n'
    'ตอนที่ 350 - 352 ม้าสีแดงในเปลวเพลิง\n'
    '\n🧢 ปีที่ 8\n'
    'ตอนที่ 371 - 375 ปะทะองค์กรชุดดำ ปริศนาคูณสองในคืนเดือนเพ็ญ\n'
    '\n🧢 ปีที่ 9\n'
    'ตอนที่ 412 - 413 โชว์สืบสวนของใคร\n'
    'ตอนที่ 414 - 417 ปาฎิหาริย์แห่งโคชิเอน ไม่ยอมแพ้ปีศาจที่มองไม่เห็น\n'
    'ตอนที่ 440 - 442 ข้อสันนิษฐานมายากลของโคนันและเฮย์จิ\n'
    '\n🧢 ปีที่ 11\n'
    'ตอนที่ 519 - 522 3 วันกับฮัตโตริ เฮย์จิ\n'
    'ตอนที่ 536 - 537 ฮัตโตริ เฮย์จิ ปะทะ คุโด้ ชินอิจิ แข่งคลี่คลายคดีที่ลานสกี\n'
    '\n🧢 ปีที่ 12\n'
    'ตอนที่ 564 - 565 ฟุรินคะซัน นักรบชุดเกราะในเขาวงกต\n'
    'ตอนที่ 570 - 571 ฆาตกรคือคุโด้ ชิอิจิ\n'
    'ตอนที่ 572 - 573 ตัวจริงของชินอิจิ และน้ำตาของรัน\n'
    'ตอนที่ 574 เรื่องที่อยากจะถามจริงๆ\n'
    '\n🧢 ปีที่ 13\n'
    'ตอนที่ 624 - 625 เครื่องรางแห่งความอายที่หายไป\n'
    'ตอนที่ 661 ผูัเคราะห์ร้ายคือคุโด้ ชินอิจิ\n'
    'ตอนที่ 662 - 664 สุนัขปีศาจ เปลวเพลิงแห่งปราสาทอินุบุชิ\n'
    '\n🧢 ปีที่ 14\n'
    'ตอนที่ 702 - 703 โคนัน ปะทะ เฮย์จิ ศึกดวลสองนักสืบตะวันออก ตะวันตก\n'
    'ตอนที่ 704 - 707 ยาพิษและดีไซน์ลวงตา\n'
    '\n🧢 ปีที่ 15\n'
    'ตอนที่ 762 - 763 เห็นกันทุกคน\n'
    'ตอนที่ 764 - 767 ฮัตโตริ เฮย์จิ กับคฤหาสน์ผีดูดเลือด\n'
    '\n🧢 ปีที่ 16\n'
    'ตอนที่ 816 - 817 โคนันกับเฮย์จิ รหัสลับแห่งรัก\n'
    '\n🧢 ปีที่ 17\n'
    'ตอนที่ 863 - 864 ที่พักของคามะอิตาจิ\n'
    '\n🧢 ปีที่ 18\n'
    'ตอนที่ 885 - 887 บ้านพักตากอากาศที่ล้อมรอบด้วยซอมบี้\n'
    'ตอนที่ 927 - 929 โคนันและเฮย์จิ ตำนานนูเอะ\n'
    '\n🧢 ปีที่ 19\n'
    'ตอนที่ 940 -941 ไขปริศนาที่ร้านปัวโรต์\n'
    'ตอนที่ 971 - 972 การแข่งขันเคนโด้แห่งความรักและการหักล้าง\n'
    '\n🧢 ปีที่ 20\n'
    'ตอนที่ 982 -983 ทัศนศึกษาสีแดง ( สีแดงสด )\n'
    'ตอนที่ 984 - 985 ทัศนศึกษาสีแดง ( รักสีแดง )\n'
    'ตอนที่ 998 - 999 ตามหามาริอะจัง!\n'
    'ตอนที่ 1022 สัตว์ประหลาดโกเมล่า ปะทะ คาเมนไยบะ ( ปฐมบท )\n'
    'ตอนที่ 1023 สัตว์ประหลาดโกเมล่า ปะทะ คาเมนไยบะ ( ทำลาย )\n'
    'ตอนที่ 1024 สัตว์ประหลาดโกเมล่า ปะทะ คาเมนไยบะ ( ไลล่า )\n'
    'ตอนที่ 1025 สัตว์ประหลาดโกเมล่า ปะทะ คาเมนไยบะ ( บทสรุป )\n'
    '\n🧢 ปีที่ 21\n'
    'ตอนที่ 1040 - 1041 จอมโจรคิด ปะทะ โคเมย์ : เป้าหมายคือริมฝีปาก\n'
    '\n🧢 เดอะมูฟวี่\n'
    'เดอะมูฟวี่ 3 ปริศนาพ่อมดคนสุดท้ายแห่งศตวรรษ\n'
    'เดอะมูฟวี่ 7 คดีฆาตกรรมแห่งเมืองปริศนา\n'
    'เดอะมูฟวี่ 10 บทเพลงมรณะแด่เหล่านักสืบ\n'
    'เดอะมูฟวี่ 14 ปริศนามรณะเหนือน่านฟ้า\n'
    'เดอะมูฟวี่ 17 ฝ่าวิกฤติเรือรบมรณะ\n'
    'เดอะมูฟวี่ 21 ปริศนาเพลงกลอนซ่อนรัก\n'
    ),EP(title: 'ชินอิจิคืนร่าง',
          image: 'assets/images/ep/shinichi.jpg',
          detail: 'ปี1\n'
    'ตอน1 คดีฆาตกรรมรถไฟเหาะ\n'
    '\n🕵🏻ปี2\n'
    'ตอน49-50 คดีฆาตกรรมนักการทูต\n'
    '\n🕵🏻ปี4\n'
    'ตอน172-173 ห้องปิดตายลอยฟ้า คดีแรกของคุโด้ ชินอิจิ\n'
    '\n🕵🏻ปี5\n'
    'ตอน203-208 การคืนชีพที่เดิมพันด้วยชีวิต\n'
    '\n🕵🏻ปี7\n'
    'ตอน308-310 คุโด้ ชินอิจิกับคดีในนิวยอร์ก\n'
    '\n🕵🏻ปี11\n'
    'ตอน536-537 ฮัตโตริ เฮย์จิ ปะทะ คุโด้ ชินอิจิ แข่งคลี่คลายคดีที่ลานสกี\n'
    '\n🕵🏻ปี12\n'
    'ตอน570-571 ฆาตกรคือ คุโด้ ชินอิจิ\n'
    'ตอน572-573 ตัวจริงของชินอิจิ และน้ำตาของรัน\n'
    'ตอน574 เรื่องที่อยากถามจริงๆ\n'
    '\n🕵🏻ปี14\n'
    '\nตอน667-672 คัมภีร์ของโฮล์ม\n'
    '\n🕵🏻‍ปี17\n'
    '-ตอน825-826 คดีพิพิธภัณฑ์สัตว์น้ำของคุโด้ ชินอิจิ\n'
    'โคนัน ปี 20 ตอนที่ 982-983 “ทัศนศึกษาสีแดง (สีแดงสด)\n'
    '\nภาพยนตร์\n'
    'มูฟวี่7 คดีฆาตกรรมแห่งเมืองปีศาจ\n'

    ),
      EP(title: 'จอมโจรคิด',
          image: 'assets/images/ep/kid.jpg',
          detail: '🎩 ปีที่ 2\n'
          'ตอนที่ 78 - 79 โคนัน ปะทะ จอมโจรคิด\n'
          '\n🎩 ปีที่ 4\n'
          'ตอนที่ 142 - 144 คดีฆาตกรรมคนรักมายากล\n'
          '\n🎩 ปีที่ 5\n'
          'ตอนที่ 235 - 238 รวมพลยอดนักสืบ คุโด้ ชินอิจิ ปะทะ จอมโจรคิด\n'
          '\n🎩 ปีที่ 8\n'
          'ตอนที่ 386 - 387 มายากลกลางหาวของจอมโจรคิด\n'
          '\n🎩 ปีที่ 11\n'
          'ตอนที่ 428 - 430 การผจญภัยในบ้านร้างแสนพิลึก\n'
          '\n🎩 ปีที่ 12\n'
          'ตอนที่ 562 - 563 Teleportation ของจอมโจรคิด\n'
          'ตอนที่ 588 - 589 จอมโจรคิด ปะทะ สุดยอดตู้เซฟ\n'
          '\n🎩 ปีที่ 13\n'
          'ตอนที่ 637 เขากิเลนที่หายไปในความมืด\n'
          'ตอนที่ 638 จอมโจรคิด ปะทะ ชมรมยอดนักสืบเยาวชน\n'
          '\n🎩 ปีที่ 14\n'
          'ตอนที่ 678 -679 โคนัน จอมโจรคิด กับศึกชิงสมบัติซากาโมโตะ เรียวมะ\n'
          '\n🎩 ปีที่ 15\n'
          'ตอนที่ 753 - 756 รถด่วนสีดำ\n'
          '\n🎩 ปีที่ 16\n'
          'ตอนที่ 776 - 777 จอมโจรคิดกับนางเงือกขี้อาย\n'
          'ตอนที่ 799 - 800 จอมโจรคิด ปะทะ เคียวโงคุ มาโคโตะ\n'
          '\n🎩 ปีที่ 19\n'
          'ตอนที่ 942 - 943 จอมโจรคิดกับกล่องปริศนา\n'
          '\n🎩 ปีที่ 21\n'
          'ตอนที่ 1040 - 1041 จอมโจรคิด ปะทะ โคเมย์ : เป้าหมายคือริมฝีปาก\n'
          '\n🎩 เดอะมูฟวี่\n'
          'เดอะมูฟวี่ 3 ปริศนาพ่อมดคนสุดท้ายแห่งศตวรรษ\n'
          'เดอะมูฟวี่ 8 มนตราแห่งรัตติกาลสีเงิน\n'
          'เดอะมูฟวี่ 10 บทเพลงมรณะแด่เหล่านักสืบ\n'
          'เดอะมูฟวี่ 14 ปริศนามรณะเหนือน่านฟ้า\n'
          'เดอะมูฟวี่ 19 ดอกทานตะวันสีเพลิง\n'
          'เดอะมูฟวี่ 23 ศึกชิงอัญมณีสีคราม\n'
      ),
      EP(title: '5พยัคฆ์นักเรียนตำรวจ',
          image: 'assets/images/ep/WildPoliceStory.jpg',
          detail: 'ฟุรุยะ เรย์, มัตสึดะ จิมเปย์, ดาเตะ วาตารุ, ฮางิวาระ เคนจิ, โมโรฟุชิ ฮิโรมิสึ ปัจจุบันนอกจาก ฟุรุยะ ทุกคนเสีย ชีวิตกันหมดแล้ว แต่ทั้ง 5 ต่างก็เป็นเจ้าหน้าที่ตํารวจที่มีความสามารถโดดเด่นหาได้ยากไม่ยิ่งหย่อนไปกว่ากัน ชีวิตในแต่ละวันของพวกเขาทั้ง 5 ที่โรงเรียนตํารวจยังคงเต็มไปด้วยเหตุการณ์มากมายเหมือนเช่นเคย ท้ายที่สุดแล้ว ”สายสัมพันธ์” ของพวกเขาที่ใต้ต้นซากุระยังคงเหมือนเดิมไม่มีอะไรแทนที่ได้ นี่คือเรื่องราวชีวิตวัยรุ่นของพวกเขาทั้ง 5 ผู้ยึดมั่นในความถูกต้องและยุติธรรม...ตํานานอีกบทหนึ่งของ “ยอดนักสืบจิ๋วโคนัน” \n'
      ),
      EP(title: 'วันสบายๆของซีโร่',
          image: 'assets/images/ep/zero.jpg',
          detail: 'ในผลงานภาคแยกของ "ยอดนักสืบจิ๋วโคนัน" เรื่องนี้ นักสืบที่เป็นทั้งเจ้าหน้าที่ด้านความมั่นคงและสมาชิกขององค์กรลึกลับจะต้องคอยสลับบทบาทต่างๆ ให้แนบเนียน\n'
    '•	อามุโร่ โทรุ (ญี่ปุ่น: 安室 透; โรมาจิ: Amuro Tōru) เจ้าหน้าที่สันติบาลวัย 29 ปี ที่แฝงตัวไปในองค์กรชุดดำด้วยโค้ดเนมว่าเบอร์เบิ้น (ญี่ปุ่น: バーボン; โรมาจิ: Bābon) เขาใช้เวลาส่วนใหญ่ทำงานอยู่ในร้านปัวโรต์ใต้สำนักงานนักสืบโมริ เขาเลี้ยงหมาตัวหนึ่งชื่อฮาโร\n'
    '•	เอโนโมโตะ อาซึสะ (ญี่ปุ่น: 榎本 梓; โรมาจิ: Enomoto Azusa) บริกรหญิงวัย 23 ปี ทำงานประจำที่ร้านปัวโรต์ เธอมีหน้าตาสะสวยถือเป็นหน้าเป็นตาของร้าน มีพี่ชายคนหนึ่งชื่อเอโนโมโตะ สึงิฮิโตะ ทำงานอยู่บริษัทค้าหลักทรัพย์ในคานางาวะ เธอเลี้ยงแมวสามสีตัวหนึ่งชื่อไทอิ\n'
    '•	คาซามิ ยูยะ (ญี่ปุ่น: 風見 裕也; โรมาจิ: Kasami Yuya) เจ้าหน้าที่สันติบาลวัย 30 ปี เป็นลูกน้องคนสนิทที่เปรียบดั่งมือขวาของอามุโร่ โทรุ คาซามิมีตำแหน่งเป็นรองสารวัตร\n'
    '•	คุริยามะ มิโดริ (ญี่ปุ่น: 栗山 緑; โรมาจิ: Kuriyama Midori) เลขานุการิณีประจำสำนักงานทนายความคิซากิ เอริ\n'
    '•	อากาอิ ชูอิจิ (ญี่ปุ่น: 赤井 秀一; โรมาจิ: Akai Shūichi) เจ้าหน้าที่เอฟบีไอ เคยแฝงตัวเข้าไปในองค์กรชุดดำเช่นเดียวกับอามุโร่ มีโค้ดเนมว่า ราย หรือ ไรย์ (ญี่ปุ่น: ライ; โรมาจิ: Rai)\n'
    '•	อังเดร คาเมล (ญี่ปุ่น: アンドレ・キャメル; โรมาจิ: Andore Kyameru) เจ้าหน้าที่เอฟบีไอรูปร่างใหญ่วัย 27 ปี\n'
    '•	ฮาโร่ หมาของซีโร่'
    ),EP(title: 'ฮันซาวะตัวร้ายสุดโหด',
          image: 'assets/images/ep/Hanzawa.jpg',
          detail: 'โคนัน ฮันซาวะ ตัวร้ายสุดโหด’ ที่ว่าด้วยชีวิต ‘ฮันซาวะ (นามสมมติ)’ และการเข้ามาอาศัยในเมืองเบกะ นครแห่งอาชญากรรมระดับท็อปของโลก\n'
      'โดยเนื้อเรื่องของ Spin-off ยอดนักสืบจิ๋ว โคนัน ฮันซาวะ ตัวร้ายสุดโหด นี้จะเป็นภาคแยกแนวแก๊กตลกที่สร้างจากมังงะชื่อเดียวกัน ฝีมือ มายูโกะ คันบะ (Mayuko Kanba) ที่ตีพิมพ์ในนิตยสาร Shonen Sunday ซึ่งจะเล่าเรื่องราวการเข้ามาเริ่มต้นชีวิตใหม่กับเป้าหมายการฆ่า ‘เจ้านั่น’ ในเมืองเบกะ (เมืองที่โคนันอาศัยอยู่) ของ ‘ฮันซาวะ (นามสมมติ)’ ที่มีรูปร่างเป็นเงาคนร้ายปริศนาที่มักปรากฏตัวในเรื่องโคนัน\n'
      'และด้วยความที่เป็นการ์ตูนแก๊กล้อเลียนโคนัน ในเรื่องการจะมีการปรากฏตัวของเหล่าตัวละครที่เราคุ้นหน้าคุ้นตา (หรือบางทีก็ไม่คุ้นเท่าไหร่) ในลายเส้นที่อาจแตกต่างกันไปเสียหน่อย และในบางครั้งยังแอบแฝงไปด้วยอีสเตอร์เอ้กบางอย่างที่จะทำให้เหล่าคนที่เคยดูโคนันมาก่อนจะต้องรู้สึกเอ๊ะในใจอีกด้วย\n')
    ];
    return Scaffold(
      appBar: AppBar(
        title: Row(
          children: [
            Image.asset("assets/images/play-button.png", width: 35,height: 35,),
            const SizedBox(
              width: 30,
            ),
            const Text('ตอนนี้เกี่ยวกับ...'),
          ],
        ),
        backgroundColor: const Color.fromARGB(255, 49, 63, 99),
      ),
      body: Container(
        decoration: const BoxDecoration(
            image: DecorationImage(
              image: AssetImage("assets/images/w2.jpg"),
              fit: BoxFit.cover,
            )),
        child: ListView.builder(
          itemCount: epi.length,
          //callback function
          itemBuilder: (BuildContext context, int index) {
            var ep = epi[index];

            return Card(
              child: InkWell(
                onTap: () {
                  _handleClickProjectItem(epi[index]);
                },
                child: Padding(
                  padding: const EdgeInsets.all(16),
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Row(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          Image.asset(
                            ep.image,
                            height: 150,
                          ),
                          const SizedBox(
                            width: 10,
                          ),
                          Expanded(
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                const SizedBox(
                                  height: 55,
                                ),
                                Text(ep.title,style: const TextStyle(fontWeight: FontWeight.bold,fontSize: 20),),
                              ],
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                ),
              ),
            );
          },
        ),
      ),
    );
  }
  void _handleClickProjectItem(EP e) {
    Navigator.push(
      context,
      MaterialPageRoute(builder: (context) => EpDetailPage(ep:e,)),
    );
  }
}
