import 'package:conanproject/pages/game_info_page.dart';
import 'package:flutter/material.dart';

import '../Models/game.dart';
import 'game_detail_page.dart';

class GameListPage extends StatefulWidget {
  const GameListPage({Key? key}) : super(key: key);

  @override
  State<GameListPage> createState() => _GameListPageState();
}

class _GameListPageState extends State<GameListPage> {
  List<Game> games = [
    Game(
        level: 'easy',
        title: 'น้ำแก้วหนึ่ง',
        question: 'ชายคนหนึ่งเดินไปที่บาร์แล้วกล่าวว่า \n'
            '“พี่ครับ ขอน้ำแก้วนึง” เมื่อบริกรได้ยินชายคนนี้\n'
            'เข้าก็หยิบปืนออกมาจากลิ้นชักแล้วเล็งไปที่ศรีษะของชายคนนั้น\n'
            'ต่อมาชายคนนั้นก็กล่าวขอบคุณแล้วก็เดินออกจากบาร์นี้ไป',
        answer: 'ชายคนนี้เข้ามาที่บาร์พร้อมกับกำลังสะอึก\n'
            'และกำลังแก้อาการด้วยการดื่มน้ำ \n'
            'ซึ่งบริกรเข้าใจสถานการณืดี \n'
            'จึงหยิบปืนขึ้นมาเพื่อให้เขาตกใจจนหายสะอึก\n'
            'เข้าจึงขอบคุณบริกรที่ทำให้อาการสะอึกหายไป',
        image: 'assets/images/game/glass-of-water.png'),
    Game(
        level: 'easy',
        title: 'แสงสุดท้าย',
        question: 'บีมเห็นแสงจ้า ซึ่งทำให้เขาชะงักงัน หลักจากนั้นเข้าก็ตาย',
        answer: 'บีมเป็นกระต่ายเลี้ยงที่หนีออกมาจากบ้าน\n'
            ' เมื่อเขากำลังข้ามถนนในเวลากลางคืน \n'
            'แสงไฟจากรถยนต์จ้าจนทำให้มันตาพร่ามัว\n'
            'โดยที่คนขับรถไม่เห็นมัน \n'
            'แล้วขับรถเหยียบมันตาย',
        image: 'assets/images/game/street-light.png'),
    Game(
        level: 'easy',
        title: 'จ๋อม',
        question:
            'ทอมล่องเรือไปซักพัก\n'
                'เขาก็เผลอทำนาฬิกาหล่นน้ำไป\n'
                'แม้ว่าเขาเป็นนักดำน้ำมืออาชีพ\n'
                'อย่างไรก็ตามแต่เขาไม่สามารถ\n'
                'ที่จะดำลงไปเอานาฬิกาเขาคืนมาได้',
        answer:
            'ทอมล่องเรื่อที่ทะเลเดธซี\n'
                ' เนื่องจากความเข้มข้นของเกลือสูง\n'
                'จนคนไม่สามารถดำน้ำลงไปได้เลย\n'
                'เขาจึงไม่สามารถนำนาฬิกาของเขากลับคืนมาได้',
        image: 'assets/images/game/watch.png'),
    Game(
        level: 'easy',
        title: 'หลงทาง',
        question:
            'แบงค์เดินทางโดยใช้เข็มทิศ\n'
                'หลังจากที่เขาเดินไปเรื่อยๆแล้วหยุดกินของว่าง\n'
                'เขาก็กลับไม่สามารถหาทางเดินกลับไปทางเก่าได้อีกเลย',
        answer:
            'แบงค์เป็นนักวิทยาศาสตร์\n'
                'ที่ทำงานใกล้กับขั้วโลกเหนือ\n'
                'ไม่ว่าจะอยู่ตรงไหนเข็มทิศก็ชี้ลงทิศใต้\n'
                'ดังนั้นเข็มทิศจึงไม่สามารถช่วยบอกทิศทางได้เลย',
        image: 'assets/images/game/compass.png'),
    Game(
        level: 'easy',
        title: 'กระโดดลงมาจากชั้น6',
        question:
            'หญิงสาวคนหนึ่งกระโดดลงมาจากขอบหน้าต่างชั้น 6\n'
                'แต่เธอกลับไม่ได้รับบาดเจ็บเลยแม้แต่น้อย',
        answer:
            'ผู้หญิงคนนี้ตั้งใจฆ่าตัวตาย\n'
                'ต่เธอกลับเปลี่ยนใจในวินาทีสุดท้าย\n'
                'และกระโดดกลับมาที่พื้นห้องของเธอเอง',
        image: 'assets/images/game/apartment.png'),
    Game(
        level: 'medium',
        title: 'ไฟดับ',
        question:
            'ระหว่างการทำงานของหญิงคนหนึ่ง\n'
                'เธอกำลังเดินลงบันได ปรากฏว่าไฟดับ\n'
                ' แล้วในเวลาต่อมาไม่นานนัก\n'
                'เธอก็รู้ว่าสามีเธอตายแล้ว',
        answer:
            'หญิงสาวคนนี้ทำงานเป็นช่างไฟฟ้าของโรงพยาบาล\n'
                'และเธอรู้ว่าไฟฉุกเฉินเสียหาย ซึ่งสามีของเธอถูกรถชน\n'
                'และกำลังแอดมิดอยู่ในโรงพยาบาลแห่งนี้ \n'
                'เพื่อพยุงชีวิตของเขาจึงต้องใช้เครื่องช่วยหายใจตลอดแล้วเมื่อไฟดับ\n'
                'เธอจึงรับรู้ว่าสามีของเธอที่ไม่สามารถ\n'
                'หายใจด้วยตัวเองได้ต้องตายอย่างแน่นอน',
        image: 'assets/images/game/stairs.png'),
    Game(
        level: 'medium',
        title: 'ประตูที่เปิดอยู่',
        question:
            'มาร์ชตื่นขึ้นมาในตอนเช้า\n'
                'เขาตื่นเต้นมากที่เห็นประตูเปิดอยู่\n'
                'แต่เมื่อเขาออกจากประตูได้ไม่นานนักหัวเขาก็ขาด',
        answer:
            'มาร์ชเป็นนกขมิ้น\n'
                'เขาอาศัยอยู่ในกรงเป็นเวลา 4 เดือน\n'
                'ซึ่งตลอดเวลาที่อาศัยอยู่มีแมวตัวหนึ่งที่หาโอกาสที่จะจับมันมากินอยู่\n'
                'เมื่อเจ้าของออกไปโดนเผลอเปิดกรงทิ้งไว้\n'
                'มาร์ชจึงได้โอกาสออกมาและเจ้าแมวก็รีบกระโดดงับหัวเจ้านกขมิ้น',
        image: 'assets/images/game/door.png'),
    Game(
        level: 'medium',
        title: 'ต่างก็นอนคลุกฝุนทั้งคู่',
        question:
            'ชายสองคนชนต่อยกันอย่างเมามันส์\n'
                'และทั้งคู่ก็ล้มลงไปนอนกองกับพื้น',
        answer:
            'ลูกสาวของนักมวยคนหนึ่งในนั้นถูกลักพาตัว\n'
                'และเธอถูกขู่ฆ่าถ้าพ่อของเธอชนะในครั้งนี้\n'
            'ในช่วงจุบจบของการชกมวย\n'
                'นักชกคู่แข่งของพ่อลูกสาวเกิดหมดสติ\n'
                'เขาจึงตัดสินใจล้มตามไปด้วย\n'
                'เพื่อให้ผลการแข่งขันออกมาเสมอกัน',
        image: 'assets/images/game/wrestling.png'),
    Game(
        level: 'medium',
        title: 'พยานผู้เห็นเหตุการณ์ลักพาตัว',
        question:
            'นักธุรกิจหนุ่มเป็นพยานให้การณ์\n'
                'เรื่องที่เขาเห็นเหตุการณ์ในการลักพาตัว\n'
                'ไม่ว่าอย่างไรก็ตามเมื่อเขาเล่าให้ตำรวจฟัง\n'
                'ตำรวจกลับไม่เชื่อคำพูดของเขา',
        answer:
            'หลังจากที่เขาออกจากร้านทำฟันปากของเขายังชาอยู่\n'
                'ทำให้เขาเล่าความแบบฟังไม่รุ้เรื่อง\n'
                'ตำรวจจึงคิดว่าเขาเมาเหล้าและไม่ใส่ใจกับคำพูดของเขานัก',
        image: 'assets/images/game/witness.png'),
    Game(
        level: 'medium',
        title: 'ตายก่อนกำหนด',
        question:
            'ชายคนหนึ่งเตรียมตัวตายในเร็ววัน\n'
                'แต่เขากลับตายก่อนวันที่เขาตั้งใจจะตาย',
        answer:
            'ชายคนหนึ่งเป็นคนป่วยจริงๆ\n'
                'และเขาตัดสินใจบริจาคอวัยวะของตัวเองให้เศรษฐีคนหนึ่ง\n'
                'แต่ลูกชายของเศรษฐีคนนั้นตั้งใจที่จะหุบสมบัติของพ่อ\n'
                'ลูกชายจึงวางยาพิษชายคนนั้นเพื่อให้อวัยวะของผู้บริจาค\n'
                'ไม่สามารถใช้งานกับพ่อของเขาได้',
        image: 'assets/images/game/grim-reaperr.png'),
    Game(
        level: 'hard',
        title: 'มื้อเย็นมรณะ',
        question:
            'หญิงคนหนึ่งวางแผนที่จะฆ่าสามีในระหว่างมื้อเย็น\n'
                'อย่างไรก็ตามเธอตัดสินใจฆ่าตัวตายในขณะที่กำลังเตรียมแผนนี้',
        answer:
            'เธอวางแผนฆ่าเขาด้วยการวางยาพิษลงไปในอาหาร\n'
                'ระหว่างที่เธอกำลังควานหายาพิษที่เตรียมไว้\n'
                'เธอพบว่ายาพิษหายไป ซึ่งต่อมาพบว่า\n'
                'ลูกชายของเธอตายเพราะกินยาพิษ\n'
                'เพราะนึกว่ามันเป็นขนมจึงกินมันเข้าไป\n'
                'เธอไม่สามารถทนกับสิ่งที่เกิดขึ้นได้\n'
                'จึงตัดสินใจฆ่าตัวตายตาม',
        image: 'assets/images/game/christmas-dinner.png'),
    Game(
        level: 'hard',
        title: 'อุบัติเหตุ',
        question:
            'เกิดอุบัติเหตุรถยนต์ขับชนกับมอเตอร์ไซค์\n'
                'ตำรวจมาถึงที่เกิดเหตุก็สืบสวนคดี\n'
                'พบว่ารถยนต์เลี้ยวรถกะทันหันตรงทางแยก\n'
                'ตำรวจจึงจับคนที่นั่งข้างคนขับ\n'
                'ส่วนคนขับรถตำรวจปล่อยกลับบ้านไป',
        answer:
            'คนที่ขับรถยนต์กำลังอยู่ระหว่างการหัดขับรถ\n'
                'และพอถึงทางแยกผู้ฝึกสอนเกิดบอกเลี้ยวผิดทาง\n'
                'จึงเป็นเหตุให้เขาขับรถชนมอเตอร์ไซค์\n'
                'ตำรวจพิจารณาแล้วว่าผู้ฝึกสอนจะต้องรับผิดชอบ\n'
                'ต่ออุบัติเหตุที่เกิดขึ้น ผู้ฝึกสอนจึงถูกจับ\n'
                'ส่วนคนขับก็ให้กลับบ้านไปได้',
        image: 'assets/images/game/accident.png'),
    Game(
        level: 'hard',
        title: 'ความตายในพิพิธภัณฑ์',
        question:
            'ชายคนหนึ่งสวมหมวกเกราะวิ่งออกจากพิพิธภัณฑ์\n'
                'และใต้วงแขนของเขาถือภาพวาดไว้ \n'
                'พอตำรวจเห็นเขาเข้าก็ยิงเขาไปจนถึงแก่ความตาย\n'
                'แต่ตำรวจคนนั้นก็ถูกจับกุมตัวเข้าคุก\n'
                'สองวันต่อมามีประกาศเกียรติคุณยกย่อง\n'
                'ในงานศพของชายที่ถือภาพวาดคนนั้น',
        answer:
            'ในช่วงฤดูหนาว เกิดไฟไหม้ที่พิพิธภัณฑ์\n'
                'ผู้อำนวยการพยายามปกป้องภาพวาดที่มีราคาสูงที่สุด\n'
                'จากของสะสมทั้งหมดของพิพิธภัณฑ์เอาไว้\n'
                'บังเอิญว่าตำรวจที่ไม่ได้รับแจ้งเรื่องไฟไหม้ผ่านมาเห็น\n'
                'เลยเข้าใจว่านี่คือการโจรกรรมตำรวจจึงสั่งให้เขาหยุด\n'
                'แต่ด้วยความตกใจจากไฟไหม้เขาเลยไม่ได้ยินคำสั่งจากตำรวจ\n'
                'ตำรวจจึงยิงเขาจนถึงแก่ความตาย \n'
                'แต่เมื่อตำรวจรู้ว่าทั้งหมดนี้เกิดอะไรขึ้นบ้าง\n'
                'จึงมอบตัวว่ายิงผู้อื่นจนถึงแก่ความตายโดยไม่สมควร',
        image: 'assets/images/game/art-museum.png'),
    Game(
        level: 'hard',
        title: 'เดี๋ยวก่อน...!',
        question:
            'หญิงสาวคนหนึ่งกำลังเศร้าสร้อยอยู่ที่คอนโดของเธอ\n'
                'ระหว่างนั้นเธอเฝ้ามองถนนหนทางผ่านหน้าต่าง\n'
                'ต่อมาไม่นานเธอก็กระโดดลงไป\n'
                'แต่ในห้วงเวลาที่เธอกระโดดลงไปนั้น\n'
                'มีเสียงโทรศัพท์ดังขึ้นและรู้สึกเสียดายที่กระโดดลงไปแล้ว',
        answer:
            'หลังจากที่เกิดหายนะจากรังสีนิวเคลียร์\n'
                'เธอเข้าใจว่าเธอเป็นคนสุดท้ายที่เหลือรอด\n'
                'เธอจึงตัดสินใจจะจบชีวิตตัวเองลง\n'
                'แต่พอมีโทรศัพท์เข้ามาเธอจึงรู้ว่ายังมีคนอื่นเหลือรอดอยู่\n'
                'แต่นั่นก็สายไปเสียแล้ว',
        image: 'assets/images/game/speed.png'),
    Game(
        level: 'hard',
        title: 'ร้านอาหาร',
        question:
            'ชายคนหนึ่งเข้ามาที่ร้านอาหาร\n'
                'เขาทานอาหารแล้วลุกออกจากโต๊ะ\n'
                'พร้อมทั้งร้องไห้ฟูมฟายอย่างหนัก',
        answer:
            'เขาเป็นหนึ่งในผู้รอดชีวิตจากเรืออับปาง\n'
                'เมื่อเขาถึงเกาะแห่งหนึ่งร่วมกับผู้อื่น\n'
                'พวกของเขาที่หาอาหารบอกกับเขาว่านี่เป็นเนื้อเต่า\n'
                'แต่ที่จริงแล้วนั่นคือเนื้อของเพื่อนที่เสียชีวิตแล้วต่างหาก\n'
                'พอเข้าได้ชิมรสชาติของเนื้อเต่าที่ร้านอาหารเขาจึงระลึกได้ว่า\n'
                'เนื้อที่เขากินตอนนั้นไม่ใช่เนื้อเต่า',
        image: 'assets/images/game/tortoise.png'),
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color.fromARGB(255, 49, 63, 99),
        title: Row(
          children: [
            Image.asset(
              "assets/images/grim-reaper.png",
              width: 35,
              height: 35,
            ),
            const SizedBox(
              width: 30,
            ),
            const Text('Dark story Game'),
            const SizedBox(
              width: 30,
            ),
            IconButton(
              icon: const Icon(
                Icons.info_outline_rounded,
                color: Colors.white,
              ),
              onPressed: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(builder: (context) => const GameInfoPage()),
                );
              },
            )
          ],
        ),
      ),
      body: Container(
        decoration: const BoxDecoration(
            image: DecorationImage(
          image: AssetImage("assets/images/w7.jpg"),
          fit: BoxFit.cover,
        )),
        child: ListView.builder(
          itemCount: games.length,
          //callback function
          itemBuilder: (BuildContext context, int index) {
            var game = games[index];
            return Card(
              color: setcolor(index),
              child: InkWell(
                onTap: () {
                  _handleClickProjectItem(
                      games[index], setcolor(index));
                },
                child: Padding(
                  padding: const EdgeInsets.all(16),
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Row(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          Image.asset(
                            game.image,
                            width: 100,
                          ),
                          const SizedBox(
                            width: 10,
                          ),
                          Column(
                            children: [
                              const SizedBox(height: 35),
                              Text(
                                game.title,
                                style: const TextStyle(
                                    fontSize: 20, fontWeight: FontWeight.bold),
                              ),
                            ],
                          ),
                        ],
                      ),
                    ],
                  ),
                ),
              ),
            );
          },
        ),
      ),
    );
  }

  void _handleClickProjectItem(Game g, Color c) {
    Navigator.push(
      context,
      MaterialPageRoute(
          builder: (context) => GameDetailPage(
                game: g,
                color: c,
              )),
    );
  }
}

Color setcolor(index) {
  if (index >= 0 && index <= 4) {
    return Colors.lightGreenAccent;
  } else if (index >= 5 && index <= 9) {
    return Colors.amberAccent;
  } else {
    return Colors.redAccent;
  }
}
